[
   "reviews",
   "Fast easy and inexpensive rental experience with great service\nFourth rental from them. Wish they offered seasonal rentals later into the season \nThanks!",
   "Horrible experience. I walked in to look for my buddy after leaving RAGS and could not find him. I walked around to see if there was something I could...",
   "I've been super happy w my ski rentals this season. Im a new skier and at first I was renting on the mountain... my boots were always so old and...",
   "I couldn't be happier with my purchase from Powder7. Great prices, amazing communication, plus their YouTube videos really are helpful. Will definitely buy...",
   "Really really good, thorough, ski boot fitting. Seriously way improved from REI or Epic. I am super happy with the skis and boots I bought here. Knocking...",
   "This was the best shopping experience I've had in a long time. Keenan was incredibly helpful and helped me through every piece of my setup. I'll be...",
   "Very impressed with evo Denver! There's street parking in front of the retail store and the rental store, in addition to a parking lot behind the store so...",
   "Absolutely stellar customer service. I got a new snowboard last season from their website, a Nitro. Rode it 4x before I noticed there were some raised bumps...",
   "Had to wait for 1.5 hours to get helped, when I did the guy went over everything I needed to get into a new pair of skis. Even though there was a waitlist...",
   "Graham helped me find and build my very first board, and it was perfect. I had no previous knowledge of or experience in skateboarding, and I felt like I...",
   "I haven't been in an old school board shop like this in twenty years. It was great. No skis or other fu-fu bullshit. Just skateboards, snowboards,...",
   "Dave was such a boss. \nCame in for a complete & he hooked it up!!!! \nGenuinely one of the nicest people we've met in Denver so far. \nThanks Dave",
   "I needed new ski boots, now that I am aging out of my high performance days on the slopes. I got just what I wanted -- with no upselling or attempts to...",
   "Overall: Never owned ski gear and received a thorough walkthrough of what I needed and how it should fit. Great one-stop shop for newbies who don't want to...",
   "This is a great find for good deals on new and used gear. It's a no frills kinda place and there stock is a little limited but you should definitely give...",
   "Glad Burton opened on walnut! The customer service here is excellent. I went over the crazy holiday rush and was able to scoop some bibs and a jacket as...",
   "Had an awesome experience today at Burton. William helped me out and was great. I'm a fairly new snowboarder and I'm sure I was asking so many basic...",
   "Every member of the staff here is beyond nice, insanely knowledgeable and has the patience of a saint. I am new to snowboarding and I had so many questions...",
   "We had a factory tour with Laura today.  She was the most down to earth wonderful person ever!  She was full of product knowledge and really showed us how...",
   "Handmade right here in Denver CO is a hard feat when it comes to the manufacturing process of anything really! A fantastic board warranty. Factory tours...",
   "Denver is so lucky Never Summer calls it home. The staff at Never Summer goes above and beyond the usual. I ordered a split board for my husband for...",
   "Came in looking for a set of used irons, and left with the best customer service experience in recent memory. Just happened to be driving by and figured I'd...",
   "0 STARS!!!\n\nThe following turn of events took place over the course of about 1 year as a former loyal customer.\n\n   I'm a lifelong athlete that never played...",
   "I have known Lenny for years and always recommend Lenny's to golfers that I play with.  HERE'S WHY!  My wife is now getting more into golf and was in need...",
   "Cute workers and great service. I rented my ski boots and poles from here. Not too expensive",
   "We've been to Crystal Ski Shop a handful of times and they have always provided good service. \n\nOne time in particular we had an issue with a certain part...",
   "UPDATE.\nThanks Justin for being proactive and taking care of your customers.  We will see you next time we are in Denver. \n\nORIGINAL:\nI rented snowshoes...",
   "Always a big fan when I find random, niche skis at independent shops online. Am an even bigger fan when they ship super quickly and show up pristine. I was...",
   "I walked in and I walked right back out again because he wasn't wearing a mask and said he wasn't going to wear one inside. I don't care to support a...",
   "Terrific owner - Ashton, and awesome ski shop in Denver.  Our kids are ski racers and this place is more comprehensive ski race inventory than any online...",
   "The guys at Emage are all class acts. They are the only skate shop I dig in the Denver metro area. Their knowledge and consistent customer service I...",
   "Super nice  with a organic feel of a sk8 shop. Of course I had to stop in. I love the music ! Wall of vans on point !   Hip street with all kinds of amazing...",
   "These guys are amazing. I have been a customer for a long time. Their dedication to the local skate community is incredible. The staff and owner are really...",
   "Awesome customer service! \nShout out to Chase and Andy \nMade an old lady feel confident",
   "We have been using a local ski shop for years down county line road until we found this place.  Jerry helped my son buy boots and it was such an amazing...",
   "I cannot say enough about the service provided over and over to us by our favorite associate, Ian (with a beard).  Give that man a raise!!!! He is very...",
   "Great selection of skate, surf, and snow gear. Very knowledgeable staff was helpful with me selecting my new surfskate. Wouldn't hesitate to purchase...",
   "I have been coming to this shop for years, customer service reps are super attentive and nice every time we shop here. My son bought some independent trucks...",
   "Super cool store with cool, friendly vibes. I first discovered this store when our son requested anything from here on his Christmas list. Easily done!...",
   "Friendly, knowledgeable, wonderful customer service.\n\nAfter the sad realization that I had somehow lost the entire toe strap on one of my snowboard bindings...",
   "This is a cute mom and pop ski rental shop. I take my family here. Once you are in the system, rentals are fast. The first time takes a little longer, but...",
   "What's with the crabby old lady at the front of the store? She is the first person to greet you and she is always in a bad mood. She has zero customer...",
   "Best shop with the best crew! Always welcoming and they actually use the gear they sell! (hard to find these days...) 20+ years of community involvement...",
   "Unfortunately, not only have they evolved so much in the past years in a negative Way. I remember getting my first board here when I was 4 like yesterday. I...",
   "If you're ever in Boulder,  this place is a must stop if you're interested in shoes,  clothes,  and skate boarding. With brands such as Nike sb,  vans, huf,...",
   "I cannot say enough about the high quality service at Epic Mountain Gear - Aurora location!  The staff is extremely friendly and helpful.  Mark Chavez...",
   "I cannot believe how poor the customer service has become here. I have enjoyed many purchases over the years and have always had a pleasant experience. This...",
   "Outdoor sports are big business in Colorado and Epic Mountain Gear is here to fill that need. Whether it be summer or winter I come EMG. In the summer I...",
   "This is the best ski shop in Colorado- you guys rock; helpful, knowledgeable employees. Just off I 70 on the way to the mountains, so also very conveniently...",
   "Best ski shop in the front range!\nBeen going here for years. Just bought new ski boots after a thorough and professional fitting by Quinn. The guy knows his...",
   "Walked in to get my first pair of ski boots. Tyler was awesome - incredibly knowledgeable & helpful. Took all the time and care we needed in order to get...",
   "I don''t normally write reviews for anything besides restaurants but this place needed to be recognized!\n\nTo be short and sweet by far the best in all...",
   "Took awhile to get to us despite a reservation, but when they did things went smoothly. Rental clothes weren't washed and smelled of mildew! The gloves were...",
   "Had to wait over an hour and a half to get fitted for skis. They should tell people to come at staggered times not all at once when they're available. Don't...",
   "I normally drop off at their house (shop) and pick up a few days later. Great job and good price.",
   "Wow!! You guys did an amazing job on my skis. My skis have never been tuned so we'll!! Thank you!!!",
   "Heath has tuned and waxed my board multiple times in the past year. These guys are great. They are fast, solid, responsive and have very competitive prices....",
   "Stopped in here on our way to Winter Park, for a week of skiing.  We are from Austin and had purchased our daughter a board for Christmas, from a local...",
   "Rented here for 2 seasons. Amazing experience the first season, second was 50/50. Season rentals here are a great price and the people in the store are...",
   "Reservations mean nothing here! We waited 4 hours in line for our reservations we made months before. With out any previous updates on the situation, the...",
   "For whatever reason I always thought that this was the best location to have a shop in golden. I finally stopped by the other day chatted up Cassidy who is...",
   "After hearing so many good things about Icelantic Skis--I finally went in for my first pair of \"grown up\" skis (not hand me downs). Cassidy-who runs the...",
   "Great shop. The staff is super helpful and efficient. Cassidy is extremely knowledgeable and attentive. He went above and beyond to ensure I had the right...",
   "My goodness, our experience with \"T\" was nothing shy of amazing and we highly recommend his shop. He is patient, incredibly knowledgeable, and took the time...",
   "Timur runs the best shop around. He knows what he's doing, has the best equipment for the job and he backs his work up. If you're not happy with the tune,...",
   "T is a true craftsman and goes out of his way to get your equipment spot on and ready for the mountains",
   "Today I had a turn-around experience! We had appointments to get skis and boots for my three kids, but the first employee must have been a new-hire because...",
   "My review for this place will be a mixed bag. I liked that they had what I needed but I had to search the whole store by myself to find it. I was not once...",
   "Horrible service from wait times to check out. Manager was literally arguing with customers with a take it or leave it attitude.  \n\nAvoid this place.",
   "Very nice and attentive staff. I went in to get a pedal taken off and they helped with no problems.",
   "I will admit, this place has some pretty cool gear. We were faithful to this place. The last couple times we've been in there all the employees have had...",
   "I stopped by today for a new bike helmet. I passed a couple employees and saw several standing around while I browsed and tried on different helmets. After...",
   "Love this place! \nKC the owner is personable and attentive to your needs. having shopped the big ski stores on the front range this is a welcome change when...",
   "If I could give 10 out of 5 that still is not enough for the great job Ski and Boot Lab has done for me!  I have been coming to see KC since he opened.  He...",
   "Overall excellent work, fastest I've seen, and most reasonable prices.  I'm a back country/tree snowboarder so I regularly have core shots on my board, and...",
   "Overall, my experience at Surefoot was good - the person who helped me out was attentive and knowledgeable, and my customizable boots have been a game...",
   "Overall had a great experience at Surefoot Denver! Jack was amazing and super knowledgeable! Staff answered all my questions and was really thorough in...",
   "Rory was great in fitting my new boots. Can't wait to try them out...Now we just need snow!",
   "Brandon and Sam delivered our patio furniture today!  They arrived not only with our chairs in perfect condition but with huge smiles, amazing attitudes and...",
   "Came in for snowboard rentals for the next day. Jordan assisted me and was so patient and pleasant during the whole process. I needed to try multiple boots...",
   "Luke at the Arvada store is the only reason why my wife and I drive all the way to Arvada to buy our snowboard gear. He's extremely knowledgeable of the...",
   "Great selection on boards and gear! From Never Summer to Santa Cruz! The Creature boards are the most creative boards I have seen but for the price I...",
   "This store is one of a few stores that carry stickers worth  buying. Been looking for Never Summer stickers and i finally found them here at BC Surf. Tom...",
   "Love the shop and the tour.  Have heard great things about the ski's, can't wait to pick up a pair after I move.",
   "Loved seeing how my skis were made! And over a beer was a nice bonus. \nHe folks here are super knowledgeable and friendly. I love my boards - BNKs kill it!",
   "Meier Skis are second to none. My QuickDraws seem to almost ski themselves and are by far the most responsive skis I have ever ridden. There is nothing on...",
   "So glad we went to Powder Daze. Canyon was patient and helped us find and fit our boots. He also helped us choose the skis that would work best for us.",
   "Powder Daze starts today with a VIP reception, beer from Tommyknockers, and many deals on ski passes, skis, clothing, gloves, boots, bindings...most things...",
   "Unmatched service today at Christys. Kyle was a great educator to someone buying their first set of ski boots and helped me find the perfect pair. The rest...",
   "I've been an Ikon pass holder since inception and took the option to defer last year during COVID. I got one email from Ikon in April saying my deferral...",
   "I ride mostly in Sugarbush resort. One of the perks that Ikon pass advertise is friends and family deal which they say you can get 25% off of the lift...",
   "Couldn't use the pass due to the pandemic, was brushed off with boiler plate responses and they basically stole my money.",
   "Nick was phenomenal! Extremely friendly, knowledgeable, and most importantly, patient. Rookie bike purchasers, but Nick answered any and all questions for...",
   "I recently got a board wax and my edges sharpened at Denver Bike and Ski Repair. My experience and the customer service was pleasant, and I got some good...",
   "The guy that runs the shop is just awesome! Super chill, answers with patience all my questions, takes his time and does not push the sale! \n\nI will be back!",
   "Good dudes at the bike repair.  Knowledgeable, friendly, and helpful.\nI have to write more, so...",
   "I came in here to get a whole skiing setup and the person who rang me out did a terrible job and messed it up which I thought she did so I asked the manager...",
   "I try to reserve my five stars for the places that go above and beyond expectations. My experience at Epic Mountain Gear in Littleton was exactly that and...",
   "Dropped in not long after a huge 40% off sale hoping that I wasn't too late. While the sale was definitely over (no clearance rack in sight - due to the...",
   "I LOVEEEEEE this store for many reasons. Obviously, I am a huge fan of Burton. I love their clothing for both daily wear and for snowboarding. They are one...",
   "Very knowledgeable and friendly staff. I am buying an ebike from them (Tern HSD). \nParking is a little struggle but side streets work out.",
   "Brought my bike in to have a flat fixed and had my hub and horn destroyed at no extra charge.",
   "SloHi helped us fix a used e-bike after all DIY efforts to troubleshoot failed. They stepped through options over the phone in an attempt to avoid the BIG...",
   "We have seen Apex Ski Boots in different magazines and decided to visit their demo center because our original flight out of Eagle got cancelled and had to...",
   "I recently lost the outer shells/chassis to my Apex boots and was stuck with no way to ski. I called Apex to see what my options were.\n\nI was delighted...",
   "Love the boots and with the combination of a NSP discount and the help of Eric I was able to get my boot sizing issues fixed.  The only minor issue I had...",
   "We had a terrific experience! Susie helped us select a great ski jacket for my boyfriend. I have been skiing for years but have never encountered a sales...",
   "They were gatekeeping assholes. I'm not a regular skier and came in asking for advice. They told me they weren't keen on doing me any favors and kicked me...",
   "Came in here with my gf looking for some last minute gear for a skiing trip. Susie went above and beyond for us! Single handedly turned a problematic...",
   "Great little ski shop in Parker! I didn't even know it existed until a few days ago when I urgently needed to wax my skis, and everyone was taking at least...",
   "I recommend reservation for equipment's ahead of time. Small hidden gem in Parker with good prices on rentals. Equipment are generally higher quality than...",
   "Rented skis for an out of town friend. Shop was very friendly and knowledgeable and priced great. Love that you have ample time to rent them before you ski...",
   "Excellent customer service and the online order with store pick up couldn't be easier.  REI is a staple when it comes to Colorado outdoor stuff!!",
   "I've shopped at REI for years and never had any problems Ordered four items my  card was charged and the store sent me an email saying my items were ready...",
   "Haven't shopped much, in person, during our lovely pandemic, but really enjoyed my trip to REI in Littleton.  Social distancing, monitoring the store's...",
   "Great service and reasonable price. Dropped 2 pairs of skis off to get mounted 15 minutes before they closed on Monday. On Wednesday i got both skis...",
   "I had family come into town wanting to rent skis. I recommend to my out of town family to come to our local neighborhood ski shop. We called a few days...",
   "Wonderful service and skis.  Milo went above and beyond to help us and we're so grateful.",
   "Ask for Fred to fit your ski boots here, and you're gonna have a great time!   It'd been decades since I last bought new skis.   Just got a full ski...",
   "Brenden helped me get a complete snowboard setup, he is amazingly knowledgeable, perfect job - very appreciated! Thank you! As for the store ownership, not...",
   "I was heading up to Breck for the weekend and needed new snow pants so I stopped into Epic on Arapahoe. I was short on time because I needed, but I came in...",
   "This place was recommended by a friend and ever since renting from them once, we have taken everyone that comes to visit during Ski Season here to pick up...",
   "I'd give it zero stars if I could. Overpriced by at least 20% compared to places even up in silverthorne. Staff there are not willing to help and...",
   "I've rented from here three times and I'm pretty surprised to see such low ratings. I've always had a good experience here and found the staff to be well...",
   "Above and beyond customer service in helping us get a product from another store sent to the boulder location. Shout out to Will. You're awesome!",
   "Cool enough store.  Customer service sucks.\n\nThe employees are not friendly and all they do is stand in the middle of the room flirting with eachother.",
   "Three stars for providing me with very decent board shorts at the last minute and at the end of the season. With a large selection of sports clothing for...",
   "Great company making amazing products. My experience customizing a pair of skis was excellent, Folsom took all the relevant information about my ski style...",
   "Great staff and skis.  I don't know a lot about ski construction or terminology but after I explained how I ski and what I wanted to do they were able to...",
   "I ordered a pair of Fulsoms in 2009. They are probably my favorite skis ever.  I probably put 800 days on them and still love them. I ordered a pair this...",
   "Top notch spot! Got some rental gear for a good price while I was visiting the area earlier in the year, recently visited again for help researching gravel...",
   "I cannot tell y'all how HAPPY I was! I walked into the REI just to browse and found my dream coat I'd been searching for. Not to mention it was HALF OFF!...",
   "The staff here seriously makes my day on every visit. Today I spent an hour running around Boulder looking for the simplest item for my skis and REI team...",
   "Came in with a flat and the Man inside was super chill and took the time out of his busy day to fix it up for me when he had a ton of work to do.  For sure...",
   "Amazing staff, I visited over the summer and even though they were closing soon, they helped me find the skis and boots that were perfect for me for a great...",
   "Mike is our local bike doctor. His attention to detail, honesty, and customer service will have us returning time and time again!! Thanks so much for taking...",
   "My doctor referred me here, and Andrew was wonderful; knowledgeable, good listener. Worth every penny.",
   "Bottom line, it pays to use a qualified ski bootfitter for footbeds and boot work.  About two years ago Lee made me footbeds and compared to the standard...",
   "I'm finally able to ski!  A debilitating condition in my left foot has greatly limited a variety of athletic activities - skiing included. Recently, I had...",
   "During the pandemic, the turn-around for a derailleur adjustment was two weeks at a competing dealer. SloHi Bikes City Park will typically call/text me...",
   "One of the best shops in Denver. Nicest people, will fix a flat or help you out with a smile and right away if you come in with an emergency like a flat...",
   "They always get my E bike back rolling on them streets correctly!  Thanks to entire staff for your work! Will always recommend!!",
   "I would recommend Confluence, without reservation,  to anyone looking for quality paddling or ski equipment. They stock an amazing amount of inventory, and...",
   "Great Ski Maintenance Shop\n\nCame here for an edge and Wax for my snowboard and an edge, wax, and scratch full on some skis and they did great. Confluence...",
   "These guys went above and beyond to help me out with an avalanche pack canister. So grateful I decided to give them a call. Also the shop is super cool and...",
   "I highly recommend this company. It has been a very positive purchase. Great customer service, communication, easy to assemble with great step by step..."
]